app/controllers/api/v1/bright_spots_controller.rb

SELECT "bright_spots".* FROM "bright_spots"
---
  def index
    render json: BrightSpot.all

SELECT  "bright_spots".* FROM "bright_spots" WHERE "bright_spots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: {
      bright_spot: BrightSpot.find(params[:id])

SELECT  "bright_spots".* FROM "bright_spots" WHERE "bright_spots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_bright_spot
    @bright_spot = BrightSpot.find(params[:id])